J-f-Jensen/SPEEDUINO-PSOC5/speeduino/globals.h
#define FUEL_PUMP_ON() digitalWrite(pinFuelPump, HIGH)
#define FUEL_PUMP_OFF() digitalWrite(pinFuelPump, LOW)

const char TSfirmwareVersion[] = "Speeduino 2016.09";

const byte data_structure_version = 2; //This identifies the data structure when reading / writing.
//const byte page_size = 64;
const int16_t npage_size[11] = {0,288,128,288,128,288,128,160,192,128,192};
//const byte page11_size = 128;
#define MAP_PAGE_SIZE 288

struct table3D fuelTable; //16x16 fuel map
struct table3D ignitionTable; //16x16 ignition map
struct table3D afrTable; //16x16 afr target map
struct table3D boostTable; //8x8 boost map
struct table3D vvtTable; //8x8 vvt map
struct table3D trim1Table; //6x6 Fuel trim 1 map
struct table3D trim2Table; //6x6 Fuel trim 2 map
struct table3D trim3Table; //6x6 Fuel trim 3 map
struct table3D trim4Table; //6x6 Fuel trim 4 map
struct table2D taeTable; //4 bin TPS Acceleration Enrichment map (2D)
struct table2D WUETable; //10 bin Warm Up Enrichment map (2D)
struct table2D crankingEnrichTable; //4 bin cranking Enrichment map (2D)
struct table2D dwellVCorrectionTable; //6 bin dwell voltage correction (2D)
struct table2D injectorVCorrectionTable; //6 bin injector voltage correction (2D)
struct table2D IATDensityCorrectionTable; //9 bin inlet air temperature density correction (2D)
struct table2D IATRetardTable; //6 bin ignition adjustment based on inlet air temperature  (2D)
struct table2D rotarySplitTable; //8 bin ignition split curve for rotary leading/trailing  (2D)

//These are for the direct port manipulation of the injectors and coils
volatile byte *inj1_pin_port;
volatile byte inj1_pin_mask;
volatile byte *inj2_pin_port;
volatile byte inj2_pin_mask;
volatile byte *inj3_pin_port;
volatile byte inj3_pin_mask;
volatile byte *inj4_pin_port;
volatile byte inj4_pin_mask;
volatile byte *inj5_pin_port;
volatile byte inj5_pin_mask;

volatile byte *ign1_pin_port;
volatile byte ign1_pin_mask;
volatile byte *ign2_pin_port;
volatile byte ign2_pin_mask;
volatile byte *ign3_pin_port;
volatile byte ign3_pin_mask;
volatile byte *ign4_pin_port;
volatile byte ign4_pin_mask;
volatile byte *ign5_pin_port;
volatile byte ign5_pin_mask;

volatile byte *tach_pin_port;
volatile byte tach_pin_mask;
volatile byte *pump_pin_port;
volatile byte pump_pin_mask;

volatile byte *triggerPri_pin_port;
volatile byte triggerPri_pin_mask;
volatile byte *triggerSec_pin_port;
volatile byte triggerSec_pin_mask;

//These need to be here as they are used in both speeduino.ino and scheduler.ino
bool channel1InjEnabled = true;
bool channel2InjEnabled = false;
bool channel3InjEnabled = false;
bool channel4InjEnabled = false;
bool channel5InjEnabled = false;

int ignition1EndAngle = 0;
int ignition2EndAngle = 0;
int ignition3EndAngle = 0;
int ignition4EndAngle = 0;

// The statuses that a schedule can have, used to save CPU cycle - we don't need to recalc ignition and fuel values more than one time
enum schedulingStatusEnum { ScheduleDataReady, TimerScheduled, TimerFired };

// Structure used to hold values required to schedule injectors/ignition
struct schedulingStruct {
  unsigned int start_tooth; // The tooth where we start the timer
  unsigned int start_delay_uS; // The wait time before the pulse is started after we have reached the right tooth
  unsigned int pulse_width_uS; // No need to explain this :-)
  unsigned int total_timer_time_uS; // start_delay_uS + pulse_width_uS used to speed up the interrupt handling if possible
  byte next_schedule; // This is used to define the next action see example below
  schedulingStatusEnum schedule_status;
  //byte outputPortMaskStart; // Could be used to optimise actions/save timers etc., added as a remark to remeber me on the option
  //byte outputPortMaskFinish; // Could be used to optimise actions/save timers etc., added as a remark to remeber me on the option
};

// Example for how next_schedule and cylider can be used
// The scheduler use this to select the next action
// 1. If we have one injector then injectorStruct[0].next_schedule should be set to 0
// 2. In a four cylinder with sequential injection order 1-3-4-2 the following would be true
// Dependend on if
//      injectorStruct[0].next_schedule = 1; //Cyl 1
//      injectorStruct[1].next_schedule = 2; //Cyl 3
//      injectorStruct[2].next_schedule = 3; //Cyl 4
//      injectorStruct[3].next_schedule = 0; //Cyl 2

// Injector timing array, one pr. injector needed
schedulingStruct injectorStruct[5];

// Ignition timing array, one pr. coil needed
 schedulingStruct ignitionStruct[5];

// This is the size of the array used starting at 0, would be 3 for a sequential 4 cylinder engine
byte injectorStructEnd = 0; // This is change in fuel_calc.ino
byte ignitionStructEnd = 0; // This is change in ignition_calc.ino

// This value is used in calculation for tooth scheduling - used in both fuel_calc.ino and ignition_calc.ino
// Value is set in decoders.ino
byte scheduling_max_tooth_count = 0;

// When data is calculated we need to start at the array number with the smallest tooth number
// Example:
// if injectorStruct[0].start_tooth < injectorStruct[injectorStructEnd].start_tooth then the number should be 0
// if injectorStruct[0].start_tooth > injectorStruct[injectorStructEnd].start_tooth then the number should be injectorStructEnd
byte injectorStructStart = 0;
byte ignitionStructStart = 0;

// Used in the timing proces called in decoders.ino at each tooth interrupt and in the ignition and fuel calc processes
struct schedule_struct {
  byte injectorNextScheduleTooth;
  byte ignitionNextScheduleTooth;
  byte injectionNextToSchedule;
  byte ignitionNextToSchedule;
} scheduleStatusStruct;

//This is used across multiple files
unsigned long revolutionTime; //The time in uS that one revolution would take at current speed (The time tooth 1 was last seen, minus the time it was seen prior to that)

volatile byte TIMER_mask;
volatile byte LOOP_TIMER;

//The status struct contains the current values for all 'live' variables
//In current version this is 64 bytes
struct statuses {
  volatile bool hasSync;
  uint16_t RPM;
  long longRPM;
  int mapADC;
  int baroADC;
  long MAP; //Has to be a long for PID calcs (Boost control)
  byte baro; //Barometric pressure is simply the inital MAP reading, taken before the engine is running. Alternatively, can be taken from an external sensor
  byte TPS; //The current TPS reading (0% - 100%)
  byte TPSlast; //The previous TPS reading
  unsigned long TPS_time; //The time the TPS sample was taken
  unsigned long TPSlast_time; //The time the previous TPS sample was taken
  byte tpsADC; //0-255 byte representation of the TPS
  byte tpsDOT;
  volatile int rpmDOT;
  byte VE;
  byte O2;
  byte O2_2;
  int coolant;
  int cltADC;
  int IAT;
  int iatADC;
  int batADC;
  int O2ADC;
  int O2_2ADC;
  int dwell;
  byte dwellCorrection; //The amount of correction being applied to the dwell time.
  byte battery10; //The current BRV in volts (multiplied by 10. Eg 12.5V = 125)
  int8_t advance; //Signed 8 bit as advance can now go negative (ATDC)
  byte corrections;
  byte TAEamount; //The amount of accleration enrichment currently being applied
  byte egoCorrection; //The amount of closed loop AFR enrichment currently being applied
  byte wueCorrection; //The amount of warmup enrichment currently being applied
  byte batCorrection; //The amount of battery voltage enrichment currently being applied
  byte iatCorrection; //The amount of inlet air temperature adjustment currently being applied
  byte launchCorrection; //The amount of correction being applied if launch control is active
  byte flexCorrection; //Amount of correction being applied to compensate for ethanol content
  byte flexIgnCorrection; //Amount of additional advance being applied based on flex
  byte afrTarget;
  byte idleDuty;
  bool fanOn; //Whether or not the fan is turned on
  volatile byte ethanolPct; //Ethanol reading (if enabled). 0 = No ethanol, 100 = pure ethanol. Eg E85 = 85.
  unsigned long TAEEndTime; //The target end time used whenever TAE is turned on
  volatile byte squirt;
  volatile byte spark;
  volatile byte spark2;
  byte engine;
  unsigned int PW1; //In uS
  unsigned int PW2; //In uS
  unsigned int PW3; //In uS
  unsigned int PW4; //In uS
  volatile byte runSecs; //Counter of seconds since cranking commenced (overflows at 255 obviously)
  volatile byte secl; //Continous
  volatile unsigned int loopsPerSecond;
  boolean launchingSoft; //True when in launch control soft limit mode
  boolean launchingHard; //True when in launch control hard limit mode
  uint16_t freeRAM;
  unsigned int clutchEngagedRPM;
  bool flatShiftingHard;
  volatile uint16_t startRevolutions; //A counter for how many revolutions have been completed since sync was achieved.
  uint16_t boostTarget;
  byte testOutputs;
  bool testActive;
  uint16_t boostDuty; //Percentage value * 100 to give 2 points of precision
  byte idleLoad; //Either the current steps or current duty cycle for the idle control.
  uint16_t canin[16];   //16bit raw value of selected canin data for channel 0-15
  uint8_t current_caninchannel = 0; //start off at channel 0
  uint16_t crankRPM = 400; //The actual cranking RPM limit. Saves us multiplying it everytime from the config page

  //Helpful bitwise operations:
  //Useful reference: http://playground.arduino.cc/Code/BitMath
  // y = (x >> n) & 1;    // n=0..15.  stores nth bit of x in y.  y becomes 0 or 1.
  // x &= ~(1 << n);      // forces nth bit of x to be 0.  all other bits left alone.
  // x |= (1 << n);       // forces nth bit of x to be 1.  all other bits left alone.

